tutorials/untested/warmingPipe/pipeMy/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
| ========                 |                                                 | 
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \    /   O peration     | Version:  4.1                                   | 
|   \  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile 
{ 
 	 version 	 2.0; 
 	 format 	 ascii; 
 	 class 		 dictionary; 
 	 location 	 "constant"; 
 	 object 	 porosityProperties; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

// reactingCellZone
// {
// 	type		DarcyForchheimer;
// 	active		yes;
// 	cellZone	reactingCellZone;

// 	DarcyForchheimerCoeffs
// 	{
// 		d	(1.0e+12 1.0e+12 1.0e+12);
// 		f	(0.000000e+00 0.000000e+00 0.000000e+00);

// 		coordinateSystem
// 		{
// 			type		cartesian;
// 			origin		(0 0 0);
// 			coordinateRotation
// 			{
// 				type	axesRotation;
// 				e1		(1 0 0);
// 				e2		(0 0 1);
// 			}
// 		}
// 	}
// }

// ************************************************************************* //

